<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/8e0438dc-5c9c-4dfb-aca6-e03b49fab64d/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.o11y.grafana_data_source.prometheus has been deleted
  - resource "grafana_data_source" "prometheus" {
        id                 = "33"
        name               = "prod-keyserver-amp"
      - uid                = "xEzMK7w4z" -> null
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_alb.network_load_balancer must be replaced
+/- resource "aws_alb" "network_load_balancer" {
      ~ arn                              = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ arn_suffix                       = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ dns_name                         = "prod-keyserver-lb-3a8-b386cfa05af63d6b.elb.eu-central-1.amazonaws.com" -> (known after apply)
      ~ id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" -> (known after apply)
      ~ internal                         = false -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
      ~ name                             = "prod-keyserver-lb-3a8" -> (known after apply)
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [ # forces replacement
          - "subnet-003e71fe834d8ae89",
          - "subnet-01c85562ab20d9798",
          - "subnet-0ee4ef2c9f8840739",
        ] -> (known after apply) # forces replacement
      - tags                             = {} -> null
      ~ vpc_id                           = "vpc-0de9380f8679bfa0d" -> (known after apply)
      ~ zone_id                          = "Z3F0SRJ5LGBH90" -> (known after apply)
        # (4 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-003e71fe834d8ae89" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-01c85562ab20d9798" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ee4ef2c9f8840739" -> null
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/prod_keyserver_cluster/prod_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service must be replaced
-/+ resource "aws_ecs_service" "app_service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod_keyserver_cluster/prod_keyserver-service" -> (known after apply)
        name                               = "prod_keyserver-service"
      ~ platform_version                   = "LATEST" -> (known after apply)
      ~ propagate_tags                     = "NONE" -> "TASK_DEFINITION" # forces replacement
      - tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:11" -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "prod_keyserver" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "prod_keyserver"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-03ca08978acaad61d",
              - "sg-0c5dcb1588591a2ff",
            ] -> (known after apply)
          ~ subnets          = [
              - "subnet-023473815b932c502",
              - "subnet-03aa60786e5ed50ec",
              - "subnet-07bc90315391c5327",
            ] -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:11" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod_keyserver" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener must be replaced
+/- resource "aws_lb_listener" "listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/prod-keyserver-lb-3a8/b386cfa05af63d6b/e5607c95c34a4423" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/prod-keyserver-lb-3a8/b386cfa05af63d6b/e5607c95c34a4423" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/prod-keyserver-lb-3a8/b386cfa05af63d6b" # forces replacement -> (known after apply) # forces replacement
      - tags              = {} -> null
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_lb_target_group.target_group must be replaced
+/- resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-keyserver-4e6/0de87e574afd3da4" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      ~ name                               = "prod-keyserver-4e6" -> (known after apply)
      ~ preserve_client_ip                 = "false" -> (known after apply)
      + protocol_version                   = (known after apply)
      - tags                               = {} -> null
      ~ vpc_id                             = "vpc-0de9380f8679bfa0d" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-399" -> (known after apply)
          ~ timeout             = 6 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }
    }

  # module.ecs.aws_route53_record.dns_load_balancer will be updated in-place
  ~ resource "aws_route53_record" "dns_load_balancer" {
        id      = "Z098781520DYMYC4P6VDC_keys.walletconnect.com_A"
        name    = "keys.walletconnect.com"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "prod-keyserver-lb-3a8-b386cfa05af63d6b.elb.eu-central-1.amazonaws.com" -> null
          - zone_id                = "Z3F0SRJ5LGBH90" -> null
        }
      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.ecs.aws_security_group.tls_ingess must be replaced
-/+ resource "aws_security_group" "tls_ingess" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-03ca08978acaad61d" -> (known after apply)
      ~ id                     = "sg-03ca08978acaad61d" -> (known after apply)
        name                   = "prod_keyserver-tls-ingress"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0de9380f8679bfa0d" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.vpc_app_ingress must be replaced
-/+ resource "aws_security_group" "vpc_app_ingress" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0c5dcb1588591a2ff" -> (known after apply)
      ~ id                     = "sg-0c5dcb1588591a2ff" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.155.0.0/16",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "prod_keyserver-vpc-ingress-to-app"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0de9380f8679bfa0d" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_cluster.docdb_primary will be updated in-place
  ~ resource "aws_docdb_cluster" "docdb_primary" {
        id                              = "prod-keyserver-keystore-docdb-primary-cluster"
        tags                            = {}
      ~ vpc_security_group_ids          = [
          - "sg-0b1eb08038ec4a608",
        ] -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place
  ~ resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "prod-keyserver-keystore-docdb-private-subnet-group"
        name        = "prod-keyserver-keystore-docdb-private-subnet-group"
      ~ subnet_ids  = [
          - "subnet-023473815b932c502",
          - "subnet-03aa60786e5ed50ec",
          - "subnet-07bc90315391c5327",
        ] -> (known after apply)
        tags        = {}
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_secretsmanager_secret.master_password must be replaced
-/+ resource "aws_secretsmanager_secret" "master_password" {
      ~ arn                            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-keyserver-keystore-docdb-master-password-njZoec" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-keyserver-keystore-docdb-master-password-njZoec" -> (known after apply)
      ~ name                           = "prod-keyserver-keystore-docdb-master-password" -> "prod-keyserver-keystore-docdb-docdb-master-password" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      ~ rotation_enabled               = false -> (known after apply)
      + rotation_lambda_arn            = (known after apply)
      - tags                           = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_secretsmanager_secret_version.master_password must be replaced
-/+ resource "aws_secretsmanager_secret_version" "master_password" {
      ~ arn            = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-keyserver-keystore-docdb-master-password-njZoec" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-keyserver-keystore-docdb-master-password-njZoec|89F98A23-66E8-4C20-B701-EE748F4EEAD9" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:prod-keyserver-keystore-docdb-master-password-njZoec" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "89F98A23-66E8-4C20-B701-EE748F4EEAD9" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keystore_docdb.aws_security_group.service_security_group must be replaced
-/+ resource "aws_security_group" "service_security_group" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-0b1eb08038ec4a608" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.155.0.0/16",
                ]
              - description      = "Allow outbound traffic from the DocDB cluster"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-0b1eb08038ec4a608" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.155.0.0/16",
                ]
              - description      = "Allow inbound traffic to the DocDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "prod-keyserver-keystore-docdb-service"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0de9380f8679bfa0d" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.o11y.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = "P2kGF7Q4k"
          + "dashboard_title"  = "prod - keyserver"
          + "dashboard_uid"    = "prod-keyserver"
          + "docdb_cluster_id" = "prod-keyserver-keystore-docdb-primary-cluster"
          + "ecs_service_name" = "prod_keyserver-service"
          + "environment"      = "prod"
          + "load_balancer"    = (known after apply)
          + "notifications"    = jsonencode(
                [
                  + {
                      + uid = "NNOynGwVz"
                    },
                ]
            )
          + "prometheus_uid"   = (known after apply)
          + "target_group"     = (known after apply)
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.o11y.grafana_dashboard.main will be updated in-place
  ~ resource "grafana_dashboard" "main" {
      ~ config_json  = jsonencode(
            {
              - __inputs      = []
              - __requires    = []
              - annotations   = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = "-- Grafana --"
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - showIn     = 0
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - editable      = true
              - gnetId        = null
              - graphTooltip  = 1
              - hideControls  = false
              - links         = []
              - liveNow       = false
              - panels        = [
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "Mem_Avg",
                                          - "25m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "max"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "25m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver App CPU/Memory"
                          - name                = "prod Keyserver App CPU/Memory alert"
                          - noDataState         = "alerting"
                          - notifications       = []
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "CPU (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "CPU (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                          - {
                              - alias            = "Memory (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "Memory (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - ServiceName = "prod_keyserver-service"
                                }
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "MemoryUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/ECS"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "Mem_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "App CPU/Memory"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 5
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 0
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "Hosts Count"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {}
                              - expression       = ""
                              - matchExact       = false
                              - metricEditorMode = 0
                              - metricName       = "HealthyHostCount"
                              - metricQueryType  = 1
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - sql              = {
                                  - from   = {
                                      - property = {
                                          - name = "AWS/NetworkELB"
                                          - type = "string"
                                        }
                                      - type     = "property"
                                    }
                                  - select = {
                                      - name       = "MAX"
                                      - parameters = [
                                          - {
                                              - name = "HealthyHostCount"
                                              - type = "functionParameter"
                                            },
                                        ]
                                      - type       = "function"
                                    }
                                  - where  = {
                                      - expressions = [
                                          - {
                                              - operator = {
                                                  - name  = "="
                                                  - value = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                                }
                                              - property = {
                                                  - name = "LoadBalancer"
                                                  - type = "string"
                                                }
                                              - type     = "operator"
                                            },
                                        ]
                                      - type        = "and"
                                    }
                                }
                              - sqlExpression    = "SELECT MAX(HealthyHostCount) FROM \"AWS/NetworkELB\" WHERE LoadBalancer = 'net/prod-keyserver-lb-3a8/b386cfa05af63d6b'"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "Healthy Hosts"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 100
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 0
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "ActiveFlowCount_TLS"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                        ]
                      - title         = "Active NLB Flows"
                      - type          = "timeseries"
                    },
                  - {
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = "When the NLB has connection failures to the targets then these jump. We for instance had this when we had a too low file descriptor limit."
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 250
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "off"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 80
                                        },
                                    ]
                                }
                            }
                          - overrides = []
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 12
                          - x = 12
                          - y = 8
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "LB-0"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - LoadBalancer = "net/prod-keyserver-lb-3a8/b386cfa05af63d6b"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "TCP_Target_Reset_Count"
                              - metricQueryType  = 0
                              - namespace        = "AWS/NetworkELB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "A"
                              - region           = "default"
                              - statistic        = "Sum"
                            },
                        ]
                      - title         = "NLB Target Resets"
                      - type          = "timeseries"
                    },
                  - {
                      - content     = "# DocumentDB"
                      - datasource  = null
                      - gridPos     = {
                          - h = 4
                          - w = 24
                          - x = 0
                          - y = 16
                        }
                      - mode        = "markdown"
                      - title       = ""
                      - transparent = true
                      - type        = "text"
                    },
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 50,
                                        ]
                                      - type   = "gt"
                                    }
                                  - operator  = {
                                      - type = "or"
                                    }
                                  - query     = {
                                      - params = [
                                          - "CPU_Max",
                                          - "5m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "avg"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "5m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver DocumentDB CPU alert"
                          - name                = "prod Keyserver DocumentDB CPU alert"
                          - noDataState         = "alerting"
                          - notifications       = [
                              - {
                                  - uid = "NNOynGwVz"
                                },
                            ]
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 30
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 50
                                        },
                                    ]
                                }
                              - unit       = "percent"
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "CPU_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "blue"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Max"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "dark-purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                              - {
                                  - matcher    = {
                                      - id      = "byFrameRefID"
                                      - options = "Mem_Avg"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "color"
                                          - value = {
                                              - fixedColor = "purple"
                                              - mode       = "fixed"
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos       = {
                          - h = 8
                          - w = 8
                          - x = 0
                          - y = 20
                        }
                      - links         = []
                      - options       = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                            }
                          - tooltip = {
                              - mode = "multi"
                              - sort = "none"
                            }
                        }
                      - pluginVersion = "8.4.7"
                      - targets       = [
                          - {
                              - alias            = "CPU (Max)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/DocDB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Max"
                              - region           = "default"
                              - statistic        = "Maximum"
                            },
                          - {
                              - alias            = "CPU (Avg)"
                              - datasource       = {
                                  - type = "cloudwatch"
                                  - uid  = "P2kGF7Q4k"
                                }
                              - dimensions       = {
                                  - DBClusterIdentifier = "prod-keyserver-keystore-docdb-primary-cluster"
                                }
                              - expression       = ""
                              - matchExact       = true
                              - metricEditorMode = 0
                              - metricName       = "CPUUtilization"
                              - metricQueryType  = 0
                              - namespace        = "AWS/DocDB"
                              - period           = "auto"
                              - queryMode        = "Metrics"
                              - refId            = "CPU_Avg"
                              - region           = "default"
                              - statistic        = "Average"
                            },
                        ]
                      - title         = "CPU Utilization"
                      - type          = "timeseries"
                    },
                  - {
                      - alert         = {
                          - alertRuleTags       = {}
                          - conditions          = [
                              - {
                                  - evaluator = {
                                      - params = [
                                          - 4000000000,
                                        ]
                                      - type   = "lt"
                                    }
                                  - operator  = {
                                      - type = "and"
                                    }
                                  - query     = {
                                      - params = [
                                          - "Mem_Avg",
                                          - "5m",
                                          - "now",
                                        ]
                                    }
                                  - reducer   = {
                                      - params = []
                                      - type   = "min"
                                    }
                                  - type      = "query"
                                },
                            ]
                          - executionErrorState = "alerting"
                          - for                 = "5m"
                          - frequency           = "1m"
                          - handler             = 1
                          - message             = "prod Keyserver DocumentDB Freeable Memory"
                          - name                = "prod Keyserver DocumentDB Freeable Memory Alert"
                          - noDataState         = "alerting"
                          - notifications       = [
                              - {
                                  - uid = "NNOynGwVz"
                                },
                            ]
                        }
                      - datasource    = {
                          - type = "cloudwatch"
                          - uid  = "P2kGF7Q4k"
                        }
                      - description   = null
                      - fieldConfig   = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 16000000000
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 0
                                  - gradientMode      = "none"
                                  - lineInterpolation = "linear"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = false
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "none"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "area"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - steps = [
                                      - {
                                          - color = "red"
                                          - value = null
                                        },
                                      - {
                                          - color = "green"
                                          - value = 4000000000
                                        },
                                    ]
                                }
                              - unit       = "decbytes"
                            }
            
...

```

</details>

*Action: `pull_request`*